#! -*- coding: utf-8 -*-

#---------------------------------
# モジュールのインポート
#---------------------------------
import numpy as np

#---------------------------------
# 定数定義
#---------------------------------

#---------------------------------
# 関数
#---------------------------------
def add(a, b):
	return a+b

def sub(a, b):
	return a-b

def mul(a, b):
	return a*b

def dev(a, b):
	return a/b

def dot(a, b):
	return np.dot(np.array(a), np.array(b))

#---------------------------------
# メイン処理
#---------------------------------
if __name__ == '__main__':
	print(add(13, 17))
	print(sub(13, 17))
	print(mul(13, 17))
	print(dev(13, 17))
	print(dot([2, 3], [4, 5]))


