
#ifndef __COMMON_H__
#define __COMMON_H__

/*******************************************************
 * インクルードファイル
 *******************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <sys/time.h>

/*******************************************************
 * 定数定義
 *******************************************************/

/**
 * 標準出力の表示レベル
 *   MY_PRINT_LVLに定義した情報を表示する
 */
#define MY_PRINT_LVL_INFO	(0x00000001)	/**< 処理の進行情報など */
#define MY_PRINT_LVL_WARN	(0x00000002)	/**< 警告に相当する情報 */
#define MY_PRINT_LVL_ERROR	(0x00000004)	/**< 処理エラーに相当する情報 */
#define MY_PRINT_LVL		(MY_PRINT_LVL_INFO | MY_PRINT_LVL_WARN | MY_PRINT_LVL_ERROR) /**< 表示レベル */

/*******************************************************
 * 関数マクロ
 *******************************************************/

/**
 * デバッグ用 printf の定義
 * 出力有無を決めるレベルは MY_PRINT_LVL で定義する
 */
#define MY_PRINT(level, ...) { \
		if (level & MY_PRINT_LVL) { \
			struct timeval _tv; \
			gettimeofday(&_tv, NULL); \
			printf("[LVL:%08x][%6d.%06d] %s(L.%d) : ", level, (int)_tv.tv_sec, (int)_tv.tv_usec, __func__, __LINE__); \
			printf(__VA_ARGS__); \
		} \
}

/*******************************************************
 * 列挙体／構造体
 *******************************************************/

/*******************************************************
 * 関数宣言
 *******************************************************/

/*******************************************************
 * 変数宣言
 *******************************************************/

#endif /*__COMMON_H__ */
